app/controllers/lists_controller.rb

    def create
        @list = List.create(task: params[:name] , state: params[:state])
---
INSERT INTO "lists" ("user_id", "task", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["task", nil], ["state", "Ongoing"], ["created_at", "2022-02-24 07:12:21.086822"], ["updated_at", "2022-02-24 07:12:21.086822"]]

    def destroy
        @list = List.find(params[:id])
        @list.destroy
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "lists" WHERE "lists"."id" = ?  [["id", 1]]

    def update
        @list = List.find(params[:id]).update(state: params[:state])
---
SELECT "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
UPDATE "lists" SET "state" = ?, "updated_at" = ? WHERE "lists"."id" = ?  [["state", "Done"], ["updated_at", "2022-02-24 08:08:40.172554"], ["id", 2]]