app/controllers/tasks_controller.rb

INSERT INTO "tasks" ("todolist_id", "name", "state", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["todolist_id", 1], ["name", "project"], ["state", nil], ["created_at", "2022-03-06 14:27:38.896583"], ["updated_at", "2022-03-06 14:27:38.896583"]]
---
    def create
        @task = Task.create(todolist_id: params[:todolist_id] ,name: params[:name], state: params[:state])