app/controllers/todolists_controller.rb

    def index
        @todolists = Todolist.all
---
SELECT "todolists".* FROM "todolists"

    def create
        @todolist = Todolist.create(user_id: params[:user_id] ,name: params[:name] , description: params[:description])
---
INSERT INTO "todolists" ("user_id", "name", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["user_id", 1], ["name", "Internship"], ["description", "Zyda_intern"], ["created_at", "2022-03-06 13:27:18.445549"], ["updated_at", "2022-03-06 13:27:18.445549"]]