app/controllers/users_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "joo"], ["created_at", "2022-02-24 06:54:14.444711"], ["updated_at", "2022-02-24 06:54:14.444711"]]
---
    def create
        @user = User.new(params.require(:name))
        @user.save

UPDATE "users" SET "name" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "ahmed"], ["updated_at", "2022-02-24 06:13:00.590842"], ["id", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def update
        @user = User.find(params[:id]).update(params[:name])